update the logo
